app/Http/Controllers/CartController.php

    public function index(Request $request)
    {
        $cart_id = Session::get('cart');
        // $cart_id = $request->session()->get('cart');
        $cart = Cart::find($cart_id);

        $total_price = 0;
        foreach ($cart->products as $product) {
            $total_price += $product->price * $product->pivot->quantity;
        }

        return view('cart.index')
            ->with([
                'line_items' => $cart->products,
                'total_price' => $total_price,
            ]);
---
select `products`.*, `line_items`.`cart_id` as `pivot_cart_id`, `line_items`.`product_id` as `pivot_product_id`, `line_items`.`id` as `pivot_id`, `line_items`.`quantity` as `pivot_quantity` from `products` inner join `line_items` on `products`.`id` = `line_items`.`product_id` where `line_items`.`cart_id` = 13

    public function success()
    {
        $cart_id = Session::get('cart');
        LineItem::where('cart_id', $cart_id)->delete();
---
delete from `line_items` where `cart_id` = 13