app/Http/Controllers/LineItemController.php

select * from `line_items` where `cart_id` = 13 and `product_id` = '5' limit 1
---
    public function create(Request $request)
    {
        $cart_id = Session::get('cart');
        $line_item = LineItem::where('cart_id', $cart_id)
            ->where('product_id', $request->input('id'))
            ->first();

delete from `line_items` where `id` = 18
---
    public function delete(Request $request)
    {
        LineItem::destroy($request->input('id'));